#include <winsock2.h>
#pragma comment(lib,"ws2_32.lib")


#include "Warcraft.h"

#include <stdint.h>
#include "Crc32Dynamic.h"

bool FileExist( const std::string& name )
{
	ifstream f( name.c_str( ) );
	return f.good( );
}


#define IsKeyPressed(CODE) (GetAsyncKeyState(CODE) & 0x8000) > 0

HMODULE GetCurrentModule;
#pragma region Game.dll JassNatives
// Проверка являются ли игроки врагами
typedef int( __cdecl * IsPlayerEnemy )( UINT Player1, UINT Player2 ); /*Game+3C9580*/
int IsPlayerEnemyOffset = 0x3C9580;

// Получить хэндл игрока по его номеру слота
typedef UINT( __cdecl * GetPlayerByID )( int PlayerId ); /*Game+3BBB30*/
int GetPlayerByIDOffset = 0x3BBB30;

#pragma endregion


typedef signed int( __fastcall * IsDrawSkillPanel )( void *UnitAddr, int addr1 ); /*Game+34F280*/
IsDrawSkillPanel IsDrawSkillPanel_org;
IsDrawSkillPanel IsDrawSkillPanel_ptr;
int IsDrawSkillPanelOffset = 0x34F280;

typedef signed int( __thiscall * DrawSkillPanel )( void *UnitAddr, int OID ); /*Game+2774C0*/
int DrawSkillPanelOffset = 0x2774C0;



typedef signed int( __fastcall * IsDrawSkillPanelOverlay )( void *UnitAddr, int addr1 ); /*Game+34F2C0*/
IsDrawSkillPanelOverlay IsDrawSkillPanelOverlay_org;
IsDrawSkillPanelOverlay IsDrawSkillPanelOverlay_ptr;
int IsDrawSkillPanelOverlayOffset = 0x34F2C0;

typedef signed int( __thiscall * DrawSkillPanelOverlay )( void *UnitAddr, int OID ); /*Game+277570*/
int DrawSkillPanelOverlayOffset = 0x277570;




			for ( unsigned int i = 0; i < dwBytesRead; i++ )
				OutData.push_back( buffer[ i ] );
		}
		else
			break;
	}
	while ( dwBytesRead );

	if ( DownProgress == 30 )
	{
		DownProgress = 70;
	}

	if ( OutData.size( ) > 0 && AllOkay )
	{
		fopen_s( &outfile, filepath, "wb" );
		if ( outfile != NULL )
		{
			fwrite( &OutData[ 0 ], OutData.size( ), 1, outfile );
			OutData.clear( );
			fclose( outfile );
			DownStatus = 1;
		}
		else DownStatus = -1;
	}
	else DownStatus = -1;


	if ( DownProgress == 70 )
	{
		DownProgress = 100;
	}

	InternetCloseHandle( hFile );
	InternetCloseHandle( hOpen );

	return;
}

char * _addr = 0;
char * _request = 0;
char * _filepath = 0;

DWORD WINAPI SENDGETREQUEST( LPVOID )
{
	DownloadBytesGet( _addr, _request ).clear( );
	return 0;
}


DWORD WINAPI SENDSAVEFILEREQUEST( LPVOID )
{
	DownloadNewMapToFile( _addr, _filepath );
	return 0;
}

__declspec( dllexport ) int __cdecl SendGetRequest( char * addr, char * request )
{
	DownProgress = 0;
	_addr = addr; _request = request;
	DownStatus = 0;
	CreateThread( 0, 0, SENDGETREQUEST, 0, 0, 0 );
	return 0;
}

__declspec( dllexport ) int __cdecl SaveNewDotaVersionFromUrl( char * addr, char * filepath )
{
	DownProgress = 0;
	_addr = addr; _filepath = filepath;
	DownStatus = 0;
	CreateThread( 0, 0, SENDSAVEFILEREQUEST, 0, 0, 0 );
	return 0;
}

__declspec( dllexport ) int __cdecl GetDownloadStatus( int )
{
	return DownStatus;
}

__declspec( dllexport ) int __cdecl GetDownloadProgress( int )
{
	return DownProgress;
}

__declspec( dllexport ) const char * __cdecl GetLatestDownloadedString( int )
{
	return LatestDownloadedString.c_str( );
}


__declspec( dllexport ) const char * __cdecl GetCurrentMapPath( int )
{
	BuildFilePath( NULL );
	return CurrentMapPath;
}


int pOnChatMessage_offset;
vector<char *> mutedplayers;
//sub_6F2FB480
typedef void( __fastcall * pOnChatMessage )( int a1, int unused, int PlayerID, char * message, int a4, float a5 );
pOnChatMessage pOnChatMessage_org;
pOnChatMessage pOnChatMessage_ptr;
void __fastcall pOnChatMessage_my( int a1, int unused, int PlayerID, char * message, int a4, float a5 )
{
	char * playername = GetPlayerName( PlayerID, 1 );

	for ( unsigned int i = 0; i < mutedplayers.size( ); i++ )
	{
		if ( _stricmp( playername, mutedplayers[ i ] ) == 0 )
		{
			return;
		}
	}

	pOnChatMessage_ptr( a1, unused, PlayerID, message, a4, a5 );
}


__declspec( dllexport ) int __stdcall MutePlayer( const char * str )
{
	if ( !str || *str == 0 )
		return 1;
	for ( unsigned int i = 0; i < mutedplayers.size( ); i++ )
	{
		if ( _stricmp( str, mutedplayers[ i ] ) == 0 )
		{
			return 1;
		}
	}
	mutedplayers.push_back( _strdup( str ) );
	return 1;
}

__declspec( dllexport ) int __stdcall UnMutePlayer( const char * str )
{
	if ( !str || *str == 0 )
		return 1;
	for ( unsigned int i = 0; i < mutedplayers.size( ); i++ )
	{
		if ( _stricmp( str, mutedplayers[ i ] ) == 0 )
		{
			free( mutedplayers[ i ] );
			mutedplayers[ i ] = NULL;
			mutedplayers.erase( mutedplayers.begin( ) + i );
			return 1;
		}
	}
	return 1;
}



struct FloatStruct1
{
	float flt1;//0
	float flt2;//4
	float flt3;//8
	float flt4;//12
	float flt5;//16
	float flt6;//20
	float flt7;//24
	float flt8;//28
	float flt9;//32
	float flt10;//36
	float flt11;//40
	float flt12;//44
	float flt13;//48
	float flt14;//52
	float flt15;//56
	float flt16;//60
};


typedef void( __fastcall * SetGameAreaFOV )( FloatStruct1 * a1, int a2, float a3, float a4, float a5, float a6 );
SetGameAreaFOV SetGameAreaFOV_org;
SetGameAreaFOV SetGameAreaFOV_ptr;


float CustomFovFix = 1.0f;

int GetWindowXoffset = 0;
int GetWindowYoffset = 0;

int __fastcall SetGameAreaFOV_new( FloatStruct1 * a1, int _unused, float a3, float a4, float a5, float a6 )
{

	float ScreenX = *( float* ) ( GameDll + GetWindowXoffset );
	float ScreenY = *( float* ) ( GameDll + GetWindowYoffset );

	float v1 = 1.0f / sqrt( a4 * a4 + 1.0f );
	float v2 = tan( v1 * a3 * 0.5f );

	float v3 = v2 * a5;
	float v4 = v3 * a4;

	a1->flt1 = ( ( a5 * ( 4.0f / 3.0f ) ) / ( ScreenX / ScreenY ) * CustomFovFix ) / v4; // Fix 4:3 to WindowX/WindowY
	a1->flt2 = 0.0f;
	a1->flt3 = 0.0f;
	a1->flt4 = 0.0f;
	a1->flt5 = 0.0f;


	a1->flt6 = a5 / v3;
	a1->flt7 = 0.0f;
	a1->flt8 = 0.0f;
	a1->flt9 = 0.0f;
	a1->flt10 = 0.0f;


	a1->flt11 = ( a5 + a6 ) / ( a6 - a5 );
	a1->flt12 = 1.0f;
