
#include "Main.h"
#include "ViewAllySkill.h"


#include <stdint.h>
#include "Crc32Dynamic.h"

bool FileExist( const char * name )
{
	ifstream f( name );
	return f.good( );
}

//  Game.dll
int GameDll = 0;
//	Storm.dll
int StormDll = 0;
HMODULE GameDllModule = 0;
HMODULE StormDllModule = 0;
int GameVersion = 0;

#pragma region All Offsets Here

int GlobalPlayerOffset = 0;
int IsPlayerEnemyOffset = 0;
int GetPlayerByIDOffset = 0;


int DrawSkillPanelOffset = 0;
int DrawSkillPanelOverlayOffset = 0;

int IsDrawSkillPanelOffset = 0;
int IsDrawSkillPanelOverlayOffset = 0;
int IsNeedDrawUnitOriginOffset = 0;
int IsNeedDrawUnit2offset = 0;
int IsNeedDrawUnit2offsetRetAddress = 0;

BOOL * InGame = 0;
int IsWindowActive = 0;
int ChatFound = 0;

int pW3XGlobalClass = 0;
int pGameClass1 = 0;
int pWar3Data1 = 0;

int UnitVtable = 0;
int ItemVtable = 0;

int pPrintText2 = 0;


int MapNameOffset1 = 0;
int MapNameOffset2 = 0;

int pOnChatMessage_offset;

int _BarVTable = 0;

int pAttackSpeedLimit = 0;

int GetItemInSlotAddr = 0;

int GetWindowXoffset = 0;
int GetWindowYoffset = 0;

#pragma endregion


HMODULE GetCurrentModule;
#pragma region Game.dll JassNatives
// Проверка являются ли игроки врагами
typedef int( __cdecl * IsPlayerEnemy )( UINT Player1, UINT Player2 ); /*Game+3C9580*/

// Получить хэндл игрока по его номеру слота
typedef UINT( __cdecl * GetPlayerByID )( int PlayerId ); /*Game+3BBB30*/


#pragma endregion





void * GetGlobalPlayerData( )
{

	free( pos_cache );
	return ret;
}

void ReplaceIconPathIfNeed( )
{
	char * tmpstr = 0;
	if ( strstr( MPQFilePath, "Disabled\\DIS" ) )
	{
		tmpstr = repl_string( MPQFilePath, "Disabled\\DIS", "\\" );
		sprintf_s( MPQFilePath, 4000, "%s\0", tmpstr );
		free( tmpstr );
	}
}

// Функция открытия файла и получения его размера.
int __stdcall Storm_279my( const char* a1, int a2, int a3, size_t Size, int a5 )
{
	int retval = Storm_279_ptr( a1, a2, a3, Size, a5 );
	if ( !retval )
	{
		sprintf_s( MPQFilePath, 4000, "%s\0", a1 );
		ReplaceIconPathIfNeed( );
		retval = Storm_279_ptr( MPQFilePath, a2, a3, Size, a5 );
	}
	return retval;
}




char CurrentMapPath[ MAX_PATH ];
char NewMapPath[ MAX_PATH ];


void SaveCurrentMapPath( )
{
	memset( CurrentMapPath, 0, MAX_PATH );
	int offset1 = *( int* ) MapNameOffset1;
	if ( offset1 > 0 )
	{
		const char * mPath = ( const char * ) ( offset1 + MapNameOffset2 );
		sprintf_s( CurrentMapPath, MAX_PATH, "%s", mPath );
	}
}


void BuildFilePath( char * fname )
{
	SaveCurrentMapPath( );


	unsigned int MapPathSize = strlen( CurrentMapPath );
	if ( MapPathSize > 8 )// "Maps\a.w3x"
	{
		for ( unsigned int i = MapPathSize - 1; i > 0; i-- )
		{
			if ( CurrentMapPath[ i ] != '\\' )
			{
				CurrentMapPath[ i ] = '\0';
			}
			else
				break;
		}

		MapPathSize = strlen( CurrentMapPath );
		if ( MapPathSize > 4 ) // "Maps\"
		{

			memset( NewMapPath, 0, MAX_PATH );
			if ( fname != NULL && *fname != 0 )
				sprintf_s( NewMapPath, MAX_PATH, "%s%s", CurrentMapPath, fname );
			else
				sprintf_s( NewMapPath, MAX_PATH, "%s", CurrentMapPath );

		}
	}
}




__declspec( dllexport ) const char * __stdcall GetCurrentMapPath( int )
{
	BuildFilePath( NULL );
	return CurrentMapPath;
}



vector<char *> mutedplayers;
//sub_6F2FB480
typedef void( __fastcall * pOnChatMessage )( int a1, int unused, int PlayerID, char * message, int a4, float a5 );
pOnChatMessage pOnChatMessage_org;
pOnChatMessage pOnChatMessage_ptr;
void __fastcall pOnChatMessage_my( int a1, int unused, int PlayerID, char * message, int a4, float a5 )
{
	char * playername = GetPlayerName( PlayerID, 1 );

	for ( unsigned int i = 0; i < mutedplayers.size( ); i++ )
	{
		if ( _stricmp( playername, mutedplayers[ i ] ) == 0 )
		{
			return;
		}
	}

	pOnChatMessage_ptr( a1, unused, PlayerID, message, a4, a5 );
}


__declspec( dllexport ) int __stdcall MutePlayer( const char * str )
{
	if ( !str || *str == 0 )
		return 1;
	for ( unsigned int i = 0; i < mutedplayers.size( ); i++ )
	{
		if ( _stricmp( str, mutedplayers[ i ] ) == 0 )
		{
			return 1;
		}
	}
	mutedplayers.push_back( _strdup( str ) );
	return 1;
}

__declspec( dllexport ) int __stdcall UnMutePlayer( const char * str )
{
	if ( !str || *str == 0 )
		return 1;
	for ( unsigned int i = 0; i < mutedplayers.size( ); i++ )
	{
		if ( _stricmp( str, mutedplayers[ i ] ) == 0 )
		{
			free( mutedplayers[ i ] );
			mutedplayers[ i ] = NULL;
			mutedplayers.erase(  mutedplayers.begin( ) + (int)i );
			return 1;
		}
	}
	return 1;
}



struct FloatStruct1
{
	float flt1;//0
	float flt2;//4
	float flt3;//8
	float flt4;//12
	float flt5;//16
	float flt6;//20
	float flt7;//24
	float flt8;//28
	float flt9;//32
	float flt10;//36
	float flt11;//40
	float flt12;//44
	float flt13;//48
	float flt14;//52
	float flt15;//56
	float flt16;//60
};


typedef void( __fastcall * SetGameAreaFOV )( FloatStruct1 * a1, int a2, float a3, float a4, float a5, float a6 );
SetGameAreaFOV SetGameAreaFOV_org;
SetGameAreaFOV SetGameAreaFOV_ptr;


float CustomFovFix = 1.0f;


int __fastcall SetGameAreaFOV_new( FloatStruct1 * a1, int _unused, float a3, float a4, float a5, float a6 )
{

	float ScreenX = *( float* ) ( GameDll + GetWindowXoffset );
	float ScreenY = *( float* ) ( GameDll + GetWindowYoffset );

	float v1 = 1.0f / sqrt( a4 * a4 + 1.0f );
	float v2 = tan( v1 * a3 * 0.5f );

	float v3 = v2 * a5;
	float v4 = v3 * a4;

	//0,0
	//1,0
	//2,0

	a1->flt1 = ( ( a5 * ( 4.0f / 3.0f ) ) / ( ScreenX / ScreenY ) * CustomFovFix ) / v4; // Fix 4:3 to WindowX/WindowY
	a1->flt2 = 0.0f;
	a1->flt3 = 0.0f;
	a1->flt4 = 0.0f;
	a1->flt5 = 0.0f;


	a1->flt6 = a5 / v3;
	a1->flt7 = 0.0f;
	a1->flt8 = 0.0f;
	a1->flt9 = 0.0f;
	a1->flt10 = 0.0f;


	a1->flt11 = ( a5 + a6 ) / ( a6 - a5 );
	a1->flt12 = 1.0f;
	a1->flt13 = 0.0f;
	a1->flt14 = 0.0f;

